## PANDAS

Pandas is a library that provides easy exploration and analysis of data sets in Python.

In [ ]:
import pandas as pd

### Reading Data

We will commonly come across two formats for storing data : Series and Dataframe.
Series is analogous to a single column of data (one dimensional array), while Dataframe is a collection of Series.

In [ ]:
# Creating a Series
pd.Series([1, 2, 3, 4], name='Test Series')

0    1
1    2
2    3
3    4
Name: Test Series, dtype: int64

Default row numbers (called index) start from 0, but can be manually set.

In [ ]:
pd.Series([1, 2, 3, 4], index=['a','b','c','d'], name='Test Series')

a    1
b    2
c    3
d    4
Name: Test Series, dtype: int64

Dataframe is a collection of Series, and is displayed in a tabular format.

In [ ]:
# Creating a DataFrame
pd.DataFrame({'Col1':[1, 2, 3, 4], 'Col2':['a','b','c','d']})

   Col1 Col2
0     1    a
1     2    b
2     3    c
3     4    d

*Generally*, datasets are stored as .csv files, and can be imported using the `pd.read_csv('filename')` function.

### Data Exploration

##### Basic

Pandas provides a lot of functions to analyse and explore any dataset stored as a DataFrame. Let's create a test dataset and use some of these functions.

In [ ]:
# Creating DataFrame
cricketData = pd.DataFrame({
    'Player Name' : ['V Kohli', 'S Tendulkar', 'Rohit Sharma', 'S Dhawan', 'Yuvraj Singh', 'G Gambhir'],
    'No. of 50s' : [50, 60, 47, 40, 37, 39],
    'No. of 100s' : [23, 26, 15, 12, 14, 9],
    'Retired' : [False, True, False, False, False, True]
})

In [ ]:
# .head() returns top n entries, where n by default is 5
cricketData.head()

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli          50           23    False
1   S Tendulkar          60           26     True
2  Rohit Sharma          47           15    False
3      S Dhawan          40           12    False
4  Yuvraj Singh          37           14    False

In [ ]:
# .describe() returns statistical information for all numerical columns
cricketData.describe()

       No. of 50s  No. of 100s
count    6.000000     6.000000
mean    45.500000    16.500000
std      8.689074     6.595453
min     37.000000     9.000000
25%     39.250000    12.500000
50%     43.500000    14.500000
75%     49.250000    21.000000
max     60.000000    26.000000

In [ ]:
# .info() returns a list of all the columns and the number of non-null entries in each
cricketData.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Player Name    6 non-null object
No. of 50s     6 non-null int64
No. of 100s    6 non-null int64
Retired        6 non-null bool
dtypes: bool(1), int64(2), object(1)
memory usage: 230.0+ bytes

In [ ]:
print(cricketData.shape)    # shape of dataframe
print(cricketData.columns)  # lists all columns of dataframe
print(cricketData.dtypes)   # returns dtypes of all columns

(6, 4)
Index(['Player Name', 'No. of 50s', 'No. of 100s', 'Retired'], dtype='object')
Player Name    object
No. of 50s      int64
No. of 100s     int64
Retired          bool
dtype: object

In [ ]:
print(cricketData['Retired'].value_counts())  # Returns all unique values of a particular column and their counts

False    4
True     2
Name: Retired, dtype: int64

##### NaN

Real datasets have a lot of data that is invalid/not known. Such data is generally stored as `NaN` or 'Not a Number' in Python.
Pandas has functions to deal with `NaN` data directly.

In [ ]:
import numpy as np
# Let us assume that the no. of 50s of Dhenier and Tendehar are not known.
# We'll set values for these indexes (1 and 3) to NaN using np.nan (loc is explained later)
cricketData.loc[1, 'No. of 50s'] = np.nan
cricketData.loc[3, 'No. of 50s'] = np.nan

In [ ]:
# Seeing the data now
cricketData

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           23    False
1   S Tendulkar         NaN           26     True
2  Rohit Sharma        47.0           15    False
3      S Dhawan         NaN           12    False
4  Yuvraj Singh        37.0           14    False
5     G Gambhir        39.0            9     True

In [ ]:
cricketData.info()
# .info() now correctly shows only 4 non-null values for no. of 50s

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
Player Name    6 non-null object
No. of 50s     4 non-null float64
No. of 100s    6 non-null int64
Retired        6 non-null bool
dtypes: bool(1), float64(1), int64(1), object(1)
memory usage: 230.0+ bytes

In [ ]:
# isna() returns a boolean DataFrame signifying which values in DataFrame are NaN
cricketData.isna()

   Player Name  No. of 50s  No. of 100s  Retired
0        False       False        False    False
1        False        True        False    False
2        False       False        False    False
3        False        True        False    False
4        False       False        False    False
5        False       False        False    False

In [ ]:
# fillna() replaces all NaN values with given value.
# Can also use some statistical estimate like mean or median to replace NaN values
cricketData.fillna(value=0)

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           23    False
1   S Tendulkar         0.0           26     True
2  Rohit Sharma        47.0           15    False
3      S Dhawan         0.0           12    False
4  Yuvraj Singh        37.0           14    False
5     G Gambhir        39.0            9     True

In [ ]:
# dropna() drops all entries that have any NaN values in them
cricketData.dropna()

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           23    False
2  Rohit Sharma        47.0           15    False
4  Yuvraj Singh        37.0           14    False
5     G Gambhir        39.0            9     True

##### Selection

We use the `iloc` function to do index-based selection, that is we can use indexes of both rows and columns to select data.

In [ ]:
# Entire first row
cricketData.iloc[0]

Player Name    V Kohli
No. of 50s          50
No. of 100s         23
Retired          False
Name: 0, dtype: object

In [ ]:
# Entire zero index column
cricketData.iloc[:, 0]

0         V Kohli
1     S Tendulkar
2    Rohit Sharma
3        S Dhawan
4    Yuvraj Singh
5       G Gambhir
Name: Player Name, dtype: object

In [ ]:
# Columns with index 1 to 3 (exclusive)
cricketData.iloc[:, 1:3]

   No. of 50s  No. of 100s
0        50.0           23
1         NaN           26
2        47.0           15
3         NaN           12
4        37.0           14
5        39.0            9

In [ ]:
# Selects 1st, 2nd row entry in 0th column
cricketData.iloc[1:3, 0]

1     S Tendulkar
2    Rohit Sharma
Name: Player Name, dtype: object

In [ ]:
# Selects 1st, 3rd row entry in 1st column
cricketData.iloc[[1,3], 1]

1   NaN
3   NaN
Name: No. of 50s, dtype: float64

We use the `loc` function to do label-based or conditional selection.

In [ ]:
# First entry of column 'Player Name'
cricketData.loc[0, 'Player Name']

'V Kohli'

In [ ]:
# All entries of columns 'Player Name' and 'Retired'
cricketData.loc[:, ['Player Name', 'Retired']]

    Player Name  Retired
0       V Kohli    False
1   S Tendulkar     True
2  Rohit Sharma    False
3      S Dhawan    False
4  Yuvraj Singh    False
5     G Gambhir     True

In [ ]:
# Entries with no. of 100s greater than 20
cricketData.loc[cricketData['No. of 100s'] > 20]

   Player Name  No. of 50s  No. of 100s  Retired
0      V Kohli        50.0           23    False
1  S Tendulkar         NaN           26     True

In [ ]:
# Entries with no. of 100s greater than 20 and not retired
cricketData.loc[(cricketData['No. of 100s'] > 20) & (cricketData['Retired'])]

   Player Name  No. of 50s  No. of 100s  Retired
1  S Tendulkar         NaN           26     True

In [ ]:
# Entries with no. of 50s data available
cricketData.loc[cricketData['No. of 50s'].notnull()]

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           23    False
2  Rohit Sharma        47.0           15    False
4  Yuvraj Singh        37.0           14    False
5     G Gambhir        39.0            9     True

##### Grouping and Mapping

We can group all entries of a dataframe with respect from a particular column, and analyse the distribution of values of other columns values then.

In [ ]:
# We want to compare the statistics (sum, max, mean, median) of No. of 100s and 50s
# between players who are retired and who are not
cricketData.groupby('Retired')['No. of 100s', 'No. of 50s'].agg([sum, max, np.mean, np.median])

        No. of 100s                  No. of 50s
                sum max  mean median        sum   max       mean median
Retired
False            64  23  16.0   14.5      134.0  50.0  44.666667   47.0
True             35  26  17.5   17.5       39.0  39.0  39.000000   39.0

We can use mapping functions to change directly values of dataframe based on some direct function.

In [ ]:
# Suppose all players scored a century in a match, and we need to update the database accordingly
cricketData['No. of 100s'] = cricketData['No. of 100s'].map(lambda x : x + 1)   # Mapping function for a Series
cricketData

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           24    False
1   S Tendulkar         NaN           27     True
2  Rohit Sharma        47.0           16    False
3      S Dhawan         NaN           13    False
4  Yuvraj Singh        37.0           15    False
5     G Gambhir        39.0           10     True

In [ ]:
# Suppose the board decides to retire a player who's centuries are less than 15

def retireFunc(row):
    if row['No. of 100s'] <= 15:
        row['Retired'] = True
    return row

cricketData.apply(retireFunc, axis='columns')

    Player Name  No. of 50s  No. of 100s  Retired
0       V Kohli        50.0           24    False
1   S Tendulkar         NaN           27     True
2  Rohit Sharma        47.0           16    False
3      S Dhawan         NaN           13     True
4  Yuvraj Singh        37.0           15     True
5     G Gambhir        39.0           10     True